app/Controllers/Buku.php

    public function index()
    {
        $data = [
            'tampildata' => $this->buku->findAll()
        ];
---
SELECT *
FROM `tb_buku`

    public function create()
    {
        $data = [
            'tampildata' => $this->buku->findAll()
        ];
---
SELECT *
FROM `tb_buku`

    public function save()
    {
        $file=$this->request->getFile('pdf');
       //ambil nama
        $namafile=$file->getRandomName();
         //pindahin file ke folder
        $file->move('pdf',$namafile);
        // $this->request->getVar();

        $this->buku->insert([
            'judul_buku' => $this->request->getVar('judul_buku'),
            'penerbit' => $this->request->getVar('penerbit'),
            'pdf' => $namafile
        ]);
---
INSERT INTO `tb_buku` (`judul_buku`, `penerbit`, `pdf`) VALUES ('tugas', 'umam', '1643735113_262ca8d3b40a9c0bacad.pdf')